dimaie/stm32-sdr/Src/si5351_nt7s.c
/*
 * si5351.cpp - Si5351 library for Arduino
 *
 * Copyright (C) 2015 - 2019 Jason Milldrum <milldrum@gmail.com>
 *                           Dana H. Myers <k6jq@comcast.net>
 *
 * Some tuning algorithms derived from clk-si5351.c in the Linux kernel.
 * Sebastian Hesselbarth <sebastian.hesselbarth@gmail.com>
 * Rabeeh Khoury <rabeeh@solid-run.com>
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#include <stdint.h>
#include "si5351_nt7s.h"
#include "stm32f7xx_hal.h"

extern I2C_HandleTypeDef hi2c1;  // your I2C handle

static uint64_t si5351_pll_calc(Si5351*, enum si5351_pll, uint64_t,
		struct Si5351RegSet*, int32_t, uint8_t);
static uint64_t si5351_multisynth_calc(Si5351*, uint64_t, uint64_t,
		struct Si5351RegSet*);
static uint64_t si5351_multisynth67_calc(Si5351*, uint64_t, uint64_t,
		struct Si5351RegSet*);
static void si5351_update_sys_status(Si5351*, struct Si5351Status*);
static void si5351_update_int_status(Si5351*, struct Si5351IntStatus*);
static void si5351_ms_div(Si5351*, enum si5351_clock, uint8_t, uint8_t);
static uint8_t si5351_select_r_div(Si5351*, uint64_t*);
static uint8_t si5351_select_r_div_ms67(Si5351*, uint64_t*);
static uint8_t si5351_write_bulk(Si5351*, uint8_t, uint8_t, uint8_t*);
static uint8_t si5351_write(Si5351*, uint8_t, uint8_t);
static uint8_t si5351_read(Si5351*, uint8_t);

void si5351_create(Si5351 *self, uint8_t i2c_addr) {
	self->i2c_bus_addr = i2c_addr;
	self->xtal_freq[0] = SI5351_XTAL_FREQ;

	// Start by using XO ref osc as default for each PLL
	self->plla_ref_osc = SI5351_PLL_INPUT_XO;
	self->pllb_ref_osc = SI5351_PLL_INPUT_XO;
	self->clkin_div = SI5351_CLKIN_DIV_1;
}

/*
 * init(uint8_t xtal_load_c, uint32_t ref_osc_freq, int32_t corr)
 *
 * Setup communications to the Si5351 and set the crystal
 * load capacitance.
 *
 * xtal_load_c - Crystal load capacitance. Use the SI5351_CRYSTAL_LOAD_*PF
 * defines in the header file
 * xo_freq - Crystal/reference oscillator frequency in 1 Hz increments.
 * Defaults to 25000000 if a 0 is used here.
 * corr - Frequency correction constant in parts-per-billion
 *
 * Returns a uint8_tean that indicates whether a device was found on the desired
 * I2C address.
 *
 */
uint8_t si5351_init(Si5351 *self, uint8_t xtal_load_c, uint32_t xo_freq,
		int32_t corr) {
	// Start I2C comms
//	Wire.begin();

// Check for a device on the bus, bail out if it is not there
//	Wire.beginTransmission(i2c_bus_addr);
	uint8_t reg_val;
//  reg_val = Wire.endTransmission();

	if (reg_val == 0) {
		// Wait for SYS_INIT flag to be clear, indicating that device is ready
		uint8_t status_reg = 0;
		do {
			status_reg = si5351_read(self, SI5351_DEVICE_STATUS);
		} while (status_reg >> 7 == 1);

		// Set crystal load capacitance
		si5351_write(self, SI5351_CRYSTAL_LOAD,
				(xtal_load_c & SI5351_CRYSTAL_LOAD_MASK) | 0b00010010);

		// Set up the XO and CLKIN reference frequencies
		if (xo_freq != 0) {
			si5351_set_ref_freq(self, xo_freq, SI5351_PLL_INPUT_XO);
			si5351_set_ref_freq(self, xo_freq, SI5351_PLL_INPUT_CLKIN); //Also CLKIN
		} else {
			si5351_set_ref_freq(self, SI5351_XTAL_FREQ, SI5351_PLL_INPUT_XO);
			si5351_set_ref_freq(self, SI5351_XTAL_FREQ, SI5351_PLL_INPUT_CLKIN); //Also CLKIN
		}

		// Set the frequency calibrations for the XO and CLKIN
		si5351_set_correction(self, corr, SI5351_PLL_INPUT_XO);
		si5351_set_correction(self, corr, SI5351_PLL_INPUT_CLKIN);

		si5351_reset(self);

		return 1;
	} else {
		return 0;
	}
}

/*
 * reset(void)
 *
 * Call to reset the Si5351 to the state initialized by the library.
 *
 */
void si5351_reset(Si5351 *self) {
	// Initialize the CLK outputs according to flowchart in datasheet
	// First, turn them off
	si5351_write(self, 16, 0x80);
	si5351_write(self, 17, 0x80);
	si5351_write(self, 18, 0x80);
	si5351_write(self, 19, 0x80);
	si5351_write(self, 20, 0x80);
	si5351_write(self, 21, 0x80);
	si5351_write(self, 22, 0x80);
	si5351_write(self, 23, 0x80);

	// Turn the clocks back on...
	si5351_write(self, 16, 0x0c);
	si5351_write(self, 17, 0x0c);
	si5351_write(self, 18, 0x0c);
	si5351_write(self, 19, 0x0c);
	si5351_write(self, 20, 0x0c);
	si5351_write(self, 21, 0x0c);
	si5351_write(self, 22, 0x0c);
	si5351_write(self, 23, 0x0c);

	// Set PLLA and PLLB to 800 MHz for automatic tuning
	si5351_set_pll(self, SI5351_PLL_FIXED, SI5351_PLLA);
	si5351_set_pll(self, SI5351_PLL_FIXED, SI5351_PLLB);

	// Make PLL to CLK assignments for automatic tuning
	self->pll_assignment[0] = SI5351_PLLA;
	self->pll_assignment[1] = SI5351_PLLA;
	self->pll_assignment[2] = SI5351_PLLA;
	self->pll_assignment[3] = SI5351_PLLA;
	self->pll_assignment[4] = SI5351_PLLA;
	self->pll_assignment[5] = SI5351_PLLA;
	self->pll_assignment[6] = SI5351_PLLB;
	self->pll_assignment[7] = SI5351_PLLB;

	si5351_set_ms_source(self, SI5351_CLK0, SI5351_PLLA);
	si5351_set_ms_source(self, SI5351_CLK1, SI5351_PLLA);
	si5351_set_ms_source(self, SI5351_CLK2, SI5351_PLLA);
	si5351_set_ms_source(self, SI5351_CLK3, SI5351_PLLA);
	si5351_set_ms_source(self, SI5351_CLK4, SI5351_PLLA);
	si5351_set_ms_source(self, SI5351_CLK5, SI5351_PLLA);
	si5351_set_ms_source(self, SI5351_CLK6, SI5351_PLLB);
	si5351_set_ms_source(self, SI5351_CLK7, SI5351_PLLB);

	// Reset the VCXO param
	si5351_write(self, SI5351_VXCO_PARAMETERS_LOW, 0);
	si5351_write(self, SI5351_VXCO_PARAMETERS_MID, 0);
	si5351_write(self, SI5351_VXCO_PARAMETERS_HIGH, 0);

	// Then reset the PLLs
	si5351_pll_reset(self, SI5351_PLLA);
	si5351_pll_reset(self, SI5351_PLLB);

	// Set initial frequencies
	uint8_t i;
	for (i = 0; i < 8; i++) {
		self->clk_freq[i] = 0;
		si5351_output_enable(self, (enum si5351_clock) i, 0);
		self->clk_first_set[i] = 0;
	}
}

