dimaie/stm32-sdr/Src/si5351_nt7s.c
/*
 * set_freq(uint64_t freq, enum si5351_clock clk)
 *
 * Sets the clock frequency of the specified CLK output.
 * Frequency range of 8 kHz to 150 MHz
 *
 * freq - Output frequency in Hz
 * clk - Clock output
 *   (use the si5351_clock enum)
 */
uint8_t si5351_set_freq(Si5351 *self, uint64_t freq, enum si5351_clock clk) {
	struct Si5351RegSet ms_reg;
	uint64_t pll_freq;
	uint8_t int_mode = 0;
	uint8_t div_by_4 = 0;
	uint8_t r_div = 0;

	// Check which Multisynth is being set
	if ((uint8_t) clk <= (uint8_t) SI5351_CLK5) {
		// MS0 through MS5 logic
		// ---------------------

		// Lower bounds check
		if (freq > 0 && freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT) {
			freq = SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT;
		}

		// Upper bounds check
		if (freq > SI5351_MULTISYNTH_MAX_FREQ * SI5351_FREQ_MULT) {
			freq = SI5351_MULTISYNTH_MAX_FREQ * SI5351_FREQ_MULT;
		}

		// If requested freq >100 MHz and no other outputs are already >100 MHz,
		// we need to recalculate PLLA and then recalculate all other CLK outputs
		// on same PLL
		if (freq > (SI5351_MULTISYNTH_SHARE_MAX * SI5351_FREQ_MULT)) {
			// Check other clocks on same PLL
			uint8_t i;
			for (i = 0; i < 6; i++) {
				if (self->clk_freq[i]
						> (SI5351_MULTISYNTH_SHARE_MAX * SI5351_FREQ_MULT)) {
					if (i != (uint8_t) clk
							&& self->pll_assignment[i]
									== self->pll_assignment[clk]) {
						return 1; // won't set if any other clks already >100 MHz
					}
				}
			}

			// Enable the output on first set_freq only
			if (self->clk_first_set[(uint8_t) clk] == 0) {
				si5351_output_enable(self, clk, 1);
				self->clk_first_set[(uint8_t) clk] = 1;
			}

			// Set the freq in memory
			self->clk_freq[(uint8_t) clk] = freq;

			// Calculate the proper PLL frequency
			pll_freq = si5351_multisynth_calc(self, freq, 0, &ms_reg);

			// Set PLL
			si5351_set_pll(self, pll_freq, self->pll_assignment[clk]);

			// Recalculate params for other synths on same PLL
			for (i = 0; i < 6; i++) {
				if (self->clk_freq[i] != 0) {
					if (self->pll_assignment[i] == self->pll_assignment[clk]) {
						struct Si5351RegSet temp_reg;
						uint64_t temp_freq;

						// Select the proper R div value
						temp_freq = self->clk_freq[i];
						r_div = si5351_select_r_div(self, &temp_freq);

						si5351_multisynth_calc(self, temp_freq, pll_freq,
								&temp_reg);

						// If freq > 150 MHz, we need to use DIVBY4 and integer mode
						if (temp_freq
								>= SI5351_MULTISYNTH_DIVBY4_FREQ
										* SI5351_FREQ_MULT) {
							div_by_4 = 1;
							int_mode = 1;
						} else {
							div_by_4 = 0;
							int_mode = 0;
						}

						// Set multisynth registers
						si5351_set_ms(self, (enum si5351_clock) i, temp_reg,
								int_mode, r_div, div_by_4);
					}
				}
			}

			// Reset the PLL
			si5351_pll_reset(self, self->pll_assignment[clk]);
		} else {
			self->clk_freq[(uint8_t) clk] = freq;

			// Enable the output on first set_freq only
			if (self->clk_first_set[(uint8_t) clk] == 0) {
				si5351_output_enable(self, clk, 1);
				self->clk_first_set[(uint8_t) clk] = 1;
			}

			// Select the proper R div value
			r_div = si5351_select_r_div(self, &freq);

			// Calculate the synth parameters
			if (self->pll_assignment[clk] == SI5351_PLLA) {
				si5351_multisynth_calc(self, freq, self->plla_freq, &ms_reg);
			} else {
				si5351_multisynth_calc(self, freq, self->pllb_freq, &ms_reg);
			}

			// Set multisynth registers
			si5351_set_ms(self, clk, ms_reg, int_mode, r_div, div_by_4);

			// Reset the PLL
			//pll_reset(self->pll_assignment[clk]);
		}

		return 0;
	} else {
		// MS6 and MS7 logic
		// -----------------

		// Lower bounds check
		if (freq > 0 && freq < SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT) {
			freq = SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT;
		}

		// Upper bounds check
		if (freq >= SI5351_MULTISYNTH_DIVBY4_FREQ * SI5351_FREQ_MULT) {
			freq = SI5351_MULTISYNTH_DIVBY4_FREQ * SI5351_FREQ_MULT - 1;
		}

		// If one of CLK6 or CLK7 is already set when trying to set the other,
		// we have to ensure that it will also have an integer division ratio
		// with the same PLL, otherwise do not set it.
		if (clk == SI5351_CLK6) {
			if (self->clk_freq[7] != 0) {
				if (self->pllb_freq % freq == 0) {
					if ((self->pllb_freq / freq) % 2 != 0) {
						// Not an even divide ratio, no bueno
						return 1;
					} else {
						// Set the freq in memory
						self->clk_freq[(uint8_t) clk] = freq;

						// Select the proper R div value
						r_div = si5351_select_r_div_ms67(self, &freq);

						si5351_multisynth67_calc(self, freq, self->pllb_freq,
								&ms_reg);
					}
				} else {
					// Not an integer divide ratio, no good
					return 1;
				}
			} else {
				// No previous assignment, so set PLLB based on CLK6

				// Set the freq in memory
				self->clk_freq[(uint8_t) clk] = freq;

				// Select the proper R div value
				r_div = si5351_select_r_div_ms67(self, &freq);

				pll_freq = si5351_multisynth67_calc(self, freq, 0, &ms_reg);
				//self->pllb_freq = pll_freq;
				si5351_set_pll(self, pll_freq, SI5351_PLLB);
			}
		} else {
			if (self->clk_freq[6] != 0) {
				if (self->pllb_freq % freq == 0) {
					if ((self->pllb_freq / freq) % 2 != 0) {
						// Not an even divide ratio, no bueno
						return 1;
					} else {
						// Set the freq in memory
						self->clk_freq[(uint8_t) clk] = freq;

						// Select the proper R div value
						r_div = si5351_select_r_div_ms67(self, &freq);

						si5351_multisynth67_calc(self, freq, self->pllb_freq,
								&ms_reg);
					}
				} else {
					// Not an integer divide ratio, no good
					return 1;
				}
			} else {
				// No previous assignment, so set PLLB based on CLK7

				// Set the freq in memory
				self->clk_freq[(uint8_t) clk] = freq;

				// Select the proper R div value
				r_div = si5351_select_r_div_ms67(self, &freq);

				pll_freq = si5351_multisynth67_calc(self, freq, 0, &ms_reg);
				//self->pllb_freq = pll_freq;
				si5351_set_pll(self, pll_freq, self->pll_assignment[clk]);
			}
		}

		div_by_4 = 0;
		int_mode = 0;

		// Set multisynth registers (MS must be set before PLL)
		si5351_set_ms(self, clk, ms_reg, int_mode, r_div, div_by_4);

