dimaie/stm32-sdr/Src/si5351_nt7s.c
		return 0;
	}
}

/*
 * set_freq_manual(uint64_t freq, uint64_t pll_freq, enum si5351_clock clk)
 *
 * Sets the clock frequency of the specified CLK output using the given PLL
 * frequency. You must ensure that the MS is assigned to the correct PLL and
 * that the PLL is set to the correct frequency before using this method.
 *
 * It is important to note that if you use this method, you will have to
 * track that all settings are sane yourself.
 *
 * freq - Output frequency in Hz
 * pll_freq - Frequency of the PLL driving the Multisynth in Hz * 100
 * clk - Clock output
 *   (use the si5351_clock enum)
 */
uint8_t si5351_set_freq_manual(Si5351 *self, uint64_t freq, uint64_t pll_freq,
		enum si5351_clock clk) {
	struct Si5351RegSet ms_reg;
	uint8_t int_mode = 0;
	uint8_t div_by_4 = 0;

	// Lower bounds check
	if (freq > 0 && freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT) {
		freq = SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT;
	}

	// Upper bounds check
	if (freq > SI5351_CLKOUT_MAX_FREQ * SI5351_FREQ_MULT) {
		freq = SI5351_CLKOUT_MAX_FREQ * SI5351_FREQ_MULT;
	}

	uint8_t r_div;

	self->clk_freq[(uint8_t) clk] = freq;

	si5351_set_pll(self, pll_freq, self->pll_assignment[clk]);

	// Enable the output
	si5351_output_enable(self, clk, 1);

	// Select the proper R div value
	r_div = si5351_select_r_div(self, &freq);

	// Calculate the synth parameters
	si5351_multisynth_calc(self, freq, pll_freq, &ms_reg);

	// If freq > 150 MHz, we need to use DIVBY4 and integer mode
	if (freq >= SI5351_MULTISYNTH_DIVBY4_FREQ * SI5351_FREQ_MULT) {
		div_by_4 = 1;
		int_mode = 1;
	}

	// Set multisynth registers (MS must be set before PLL)
	si5351_set_ms(self, clk, ms_reg, int_mode, r_div, div_by_4);

	return 0;
}

/*
 * set_pll(uint64_t pll_freq, enum si5351_pll target_pll)
 *
 * Set the specified PLL to a specific oscillation frequency
 *
 * pll_freq - Desired PLL frequency in Hz * 100
 * target_pll - Which PLL to set
 *     (use the si5351_pll enum)
 */
void si5351_set_pll(Si5351 *self, uint64_t pll_freq, enum si5351_pll target_pll) {
	struct Si5351RegSet pll_reg;

	if (target_pll == SI5351_PLLA) {
		si5351_pll_calc(self, SI5351_PLLA, pll_freq, &pll_reg,
				self->ref_correction[self->plla_ref_osc], 0);
	} else {
		si5351_pll_calc(self, SI5351_PLLB, pll_freq, &pll_reg,
				self->ref_correction[self->pllb_ref_osc], 0);
	}

	// Derive the register values to write

	// Prepare an array for parameters to be written to
	uint8_t params[20];
	uint8_t i = 0;
	uint8_t temp;

	// Registers 26-27
	temp = ((pll_reg.p3 >> 8) & 0xFF);
	params[i++] = temp;

	temp = (uint8_t) (pll_reg.p3 & 0xFF);
	params[i++] = temp;

	// Register 28
	temp = (uint8_t) ((pll_reg.p1 >> 16) & 0x03);
	params[i++] = temp;

	// Registers 29-30
	temp = (uint8_t) ((pll_reg.p1 >> 8) & 0xFF);
	params[i++] = temp;

	temp = (uint8_t) (pll_reg.p1 & 0xFF);
	params[i++] = temp;

	// Register 31
	temp = (uint8_t) ((pll_reg.p3 >> 12) & 0xF0);
	temp += (uint8_t) ((pll_reg.p2 >> 16) & 0x0F);
	params[i++] = temp;

	// Registers 32-33
	temp = (uint8_t) ((pll_reg.p2 >> 8) & 0xFF);
	params[i++] = temp;

	temp = (uint8_t) (pll_reg.p2 & 0xFF);
	params[i++] = temp;

	// Write the parameters
	if (target_pll == SI5351_PLLA) {
		si5351_write_bulk(self, SI5351_PLLA_PARAMETERS, i, params);
		self->plla_freq = pll_freq;
	} else if (target_pll == SI5351_PLLB) {
		si5351_write_bulk(self, SI5351_PLLB_PARAMETERS, i, params);
		self->pllb_freq = pll_freq;
	}
}

/*
 * set_ms(enum si5351_clock clk, struct Si5351RegSet ms_reg, uint8_t int_mode, uint8_t r_div, uint8_t div_by_4)
 *
 * Set the specified multisynth parameters. Not normally needed, but public for advanced users.
 *
 * clk - Clock output
 *   (use the si5351_clock enum)
 * int_mode - Set integer mode
 *  Set to 1 to enable, 0 to disable
 * r_div - Desired r_div ratio
 * div_by_4 - Set Divide By 4 mode
 *   Set to 1 to enable, 0 to disable
 */
void si5351_set_ms(Si5351 *self, enum si5351_clock clk,
		struct Si5351RegSet ms_reg, uint8_t int_mode, uint8_t r_div,
		uint8_t div_by_4) {
	uint8_t params[20];
	uint8_t i = 0;
	uint8_t temp;
	uint8_t reg_val;

	if ((uint8_t) clk <= (uint8_t) SI5351_CLK5) {
		// Registers 42-43 for CLK0
		temp = (uint8_t) ((ms_reg.p3 >> 8) & 0xFF);
		params[i++] = temp;

		temp = (uint8_t) (ms_reg.p3 & 0xFF);
		params[i++] = temp;

		// Register 44 for CLK0
		reg_val = si5351_read(self, (SI5351_CLK0_PARAMETERS + 2) + (clk * 8));
		reg_val &= ~(0x03);
		temp = reg_val | ((uint8_t) ((ms_reg.p1 >> 16) & 0x03));
		params[i++] = temp;

		// Registers 45-46 for CLK0
		temp = (uint8_t) ((ms_reg.p1 >> 8) & 0xFF);
		params[i++] = temp;

		temp = (uint8_t) (ms_reg.p1 & 0xFF);
		params[i++] = temp;

		// Register 47 for CLK0
		temp = (uint8_t) ((ms_reg.p3 >> 12) & 0xF0);
		temp += (uint8_t) ((ms_reg.p2 >> 16) & 0x0F);
		params[i++] = temp;

		// Registers 48-49 for CLK0
		temp = (uint8_t) ((ms_reg.p2 >> 8) & 0xFF);
		params[i++] = temp;

		temp = (uint8_t) (ms_reg.p2 & 0xFF);
		params[i++] = temp;
	} else {
		// MS6 and MS7 only use one register
		temp = ms_reg.p1;
	}

	// Write the parameters
	switch (clk) {
	case SI5351_CLK0:
		si5351_write_bulk(self, SI5351_CLK0_PARAMETERS, i, params);
		si5351_set_int(self, clk, int_mode);
		si5351_ms_div(self, clk, r_div, div_by_4);
		break;
	case SI5351_CLK1:
		si5351_write_bulk(self, SI5351_CLK1_PARAMETERS, i, params);
		si5351_set_int(self, clk, int_mode);
		si5351_ms_div(self, clk, r_div, div_by_4);
		break;
	case SI5351_CLK2:
		si5351_write_bulk(self, SI5351_CLK2_PARAMETERS, i, params);
		si5351_set_int(self, clk, int_mode);
		si5351_ms_div(self, clk, r_div, div_by_4);
		break;
	case SI5351_CLK3:
		si5351_write_bulk(self, SI5351_CLK3_PARAMETERS, i, params);
		si5351_set_int(self, clk, int_mode);
		si5351_ms_div(self, clk, r_div, div_by_4);
		break;
	case SI5351_CLK4:
		si5351_write_bulk(self, SI5351_CLK4_PARAMETERS, i, params);
		si5351_set_int(self, clk, int_mode);
		si5351_ms_div(self, clk, r_div, div_by_4);
		break;
	case SI5351_CLK5:
		si5351_write_bulk(self, SI5351_CLK5_PARAMETERS, i, params);
		si5351_set_int(self, clk, int_mode);
		si5351_ms_div(self, clk, r_div, div_by_4);
		break;
	case SI5351_CLK6:
		si5351_write(self, SI5351_CLK6_PARAMETERS, temp);
		si5351_ms_div(self, clk, r_div, div_by_4);
		break;
	case SI5351_CLK7:
		si5351_write(self, SI5351_CLK7_PARAMETERS, temp);
		si5351_ms_div(self, clk, r_div, div_by_4);
		break;
	}
}

