dimaie/stm32-sdr/Src/si5351_nt7s.c
/*
 * output_enable(enum si5351_clock clk, uint8_t enable)
 *
 * Enable or disable a chosen output
 * clk - Clock output
 *   (use the si5351_clock enum)
 * enable - Set to 1 to enable, 0 to disable
 */
void si5351_output_enable(Si5351 *self, enum si5351_clock clk, uint8_t enable) {
	uint8_t reg_val;

	reg_val = si5351_read(self, SI5351_OUTPUT_ENABLE_CTRL);

	if (enable == 1) {
		reg_val &= ~(1 << (uint8_t) clk);
	} else {
		reg_val |= (1 << (uint8_t) clk);
	}

	si5351_write(self, SI5351_OUTPUT_ENABLE_CTRL, reg_val);
}

/*
 * drive_strength(enum si5351_clock clk, enum si5351_drive drive)
 *
 * Sets the drive strength of the specified clock output
 *
 * clk - Clock output
 *   (use the si5351_clock enum)
 * drive - Desired drive level
 *   (use the si5351_drive enum)
 */
void si5351_drive_strength(Si5351 *self, enum si5351_clock clk,
		enum si5351_drive drive) {
	uint8_t reg_val;
	const uint8_t mask = 0x03;

	reg_val = si5351_read(self, SI5351_CLK0_CTRL + (uint8_t) clk);
	reg_val &= ~(mask);

	switch (drive) {
	case SI5351_DRIVE_2MA:
		reg_val |= 0x00;
		break;
	case SI5351_DRIVE_4MA:
		reg_val |= 0x01;
		break;
	case SI5351_DRIVE_6MA:
		reg_val |= 0x02;
		break;
	case SI5351_DRIVE_8MA:
		reg_val |= 0x03;
		break;
	default:
		break;
	}

	si5351_write(self, SI5351_CLK0_CTRL + (uint8_t) clk, reg_val);
}

/*
 * update_status(void)
 *
 * Call this to update the status structs, then access them
 * via the dev_status and dev_int_status global members.
 *
 * See the header file for the struct definitions. These
 * correspond to the flag names for registers 0 and 1 in
 * the Si5351 datasheet.
 */
void si5351_update_status(Si5351 *self) {
	si5351_update_sys_status(self, &(self->dev_status));
	si5351_update_int_status(self, &(self->dev_int_status));
}

/*
 * set_correction(int32_t corr, enum si5351_pll_input ref_osc)
 *
 * corr - Correction factor in ppb
 * ref_osc - Desired reference oscillator
 *     (use the si5351_pll_input enum)
 *
 * Use this to set the oscillator correction factor.
 * This value is a signed 32-bit integer of the
 * parts-per-billion value that the actual oscillation
 * frequency deviates from the specified frequency.
 *
 * The frequency calibration is done as a one-time procedure.
 * Any desired test frequency within the normal range of the
 * Si5351 should be set, then the actual output frequency
 * should be measured as accurately as possible. The
 * difference between the measured and specified frequencies
 * should be calculated in Hertz, then multiplied by 10 in
 * order to get the parts-per-billion value.
 *
 * Since the Si5351 itself has an intrinsic 0 PPM error, this
 * correction factor is good across the entire tuning range of
 * the Si5351. Once this calibration is done accurately, it
 * should not have to be done again for the same Si5351 and
 * crystal.
 */
void si5351_set_correction(Si5351 *self, int32_t corr,
		enum si5351_pll_input ref_osc) {
	self->ref_correction[(uint8_t) ref_osc] = corr;

	// Recalculate and set PLL freqs based on correction value
	si5351_set_pll(self, self->plla_freq, SI5351_PLLA);
	si5351_set_pll(self, self->pllb_freq, SI5351_PLLB);
}

/*
 * set_phase(enum si5351_clock clk, uint8_t phase)
 *
 * clk - Clock output
 *   (use the si5351_clock enum)
 * phase - 7-bit phase word
 *   (in units of VCO/4 period)
 *
 * Write the 7-bit phase register. This must be used
 * with a user-set PLL frequency so that the user can
 * calculate the proper tuning word based on the PLL period.
 */
void si5351_set_phase(Si5351 *self, enum si5351_clock clk, uint8_t phase) {
	// Mask off the upper bit since it is reserved
	phase = phase & 0b01111111;

	si5351_write(self, SI5351_CLK0_PHASE_OFFSET + (uint8_t) clk, phase);
}

/*
 * get_correction(enum si5351_pll_input ref_osc)
 *
 * ref_osc - Desired reference oscillator
 *     0: crystal oscillator (XO)
 *     1: external clock input (CLKIN)
 *
 * Returns the oscillator correction factor stored
 * in RAM.
 */
int32_t si5351_get_correction(Si5351 *self, enum si5351_pll_input ref_osc) {
	return self->ref_correction[(uint8_t) ref_osc];
}

/*
 * pll_reset(enum si5351_pll target_pll)
 *
 * target_pll - Which PLL to reset
 *     (use the si5351_pll enum)
 *
 * Apply a reset to the indicated PLL.
 */
void si5351_pll_reset(Si5351 *self, enum si5351_pll target_pll) {
	if (target_pll == SI5351_PLLA) {
		si5351_write(self, SI5351_PLL_RESET, SI5351_PLL_RESET_A);
	} else if (target_pll == SI5351_PLLB) {
		si5351_write(self, SI5351_PLL_RESET, SI5351_PLL_RESET_B);
	}
}

/*
 * set_ms_source(enum si5351_clock clk, enum si5351_pll pll)
 *
 * clk - Clock output
 *   (use the si5351_clock enum)
 * pll - Which PLL to use as the source
 *     (use the si5351_pll enum)
 *
 * Set the desired PLL source for a multisynth.
 */
void si5351_set_ms_source(Si5351 *self, enum si5351_clock clk,
		enum si5351_pll pll) {
	uint8_t reg_val;

	reg_val = si5351_read(self, SI5351_CLK0_CTRL + (uint8_t) clk);

	if (pll == SI5351_PLLA) {
		reg_val &= ~(SI5351_CLK_PLL_SELECT);
	} else if (pll == SI5351_PLLB) {
		reg_val |= SI5351_CLK_PLL_SELECT;
	}

	si5351_write(self, SI5351_CLK0_CTRL + (uint8_t) clk, reg_val);

	self->pll_assignment[(uint8_t) clk] = pll;
}

/*
 * set_int(enum si5351_clock clk, uint8_t int_mode)
 *
 * clk - Clock output
 *   (use the si5351_clock enum)
 * enable - Set to 1 to enable, 0 to disable
 *
 * Set the indicated multisynth into integer mode.
 */
void si5351_set_int(Si5351 *self, enum si5351_clock clk, uint8_t enable) {
	uint8_t reg_val;
	reg_val = si5351_read(self, SI5351_CLK0_CTRL + (uint8_t) clk);

	if (enable == 1) {
		reg_val |= (SI5351_CLK_INTEGER_MODE);
	} else {
		reg_val &= ~(SI5351_CLK_INTEGER_MODE);
	}

	si5351_write(self, SI5351_CLK0_CTRL + (uint8_t) clk, reg_val);

	// Integer mode indication
	/*
	 switch(clk)
	 {
	 case SI5351_CLK0:
	 clk0_int_mode = enable;
	 break;
	 case SI5351_CLK1:
	 clk1_int_mode = enable;
	 break;
	 case SI5351_CLK2:
	 clk2_int_mode = enable;
	 break;
	 default:
	 break;
	 }
	 */
}

/*
 * set_clock_pwr(enum si5351_clock clk, uint8_t pwr)
 *
 * clk - Clock output
 *   (use the si5351_clock enum)
 * pwr - Set to 1 to enable, 0 to disable
 *
 * Enable or disable power to a clock output (a power
 * saving feature).
 */
void si5351_set_clock_pwr(Si5351 *self, enum si5351_clock clk, uint8_t pwr) {
	uint8_t reg_val; //, reg;
	reg_val = si5351_read(self, SI5351_CLK0_CTRL + (uint8_t) clk);

