dimaie/stm32-sdr/Src/si5351_nt7s.c
	if (pwr == 1) {
		reg_val &= 0b01111111;
	} else {
		reg_val |= 0b10000000;
	}

	si5351_write(self, SI5351_CLK0_CTRL + (uint8_t) clk, reg_val);
}

/*
 * set_clock_invert(enum si5351_clock clk, uint8_t inv)
 *
 * clk - Clock output
 *   (use the si5351_clock enum)
 * inv - Set to 1 to enable, 0 to disable
 *
 * Enable to invert the clock output waveform.
 */
void si5351_set_clock_invert(Si5351 *self, enum si5351_clock clk, uint8_t inv) {
	uint8_t reg_val;
	reg_val = si5351_read(self, SI5351_CLK0_CTRL + (uint8_t) clk);

	if (inv == 1) {
		reg_val |= (SI5351_CLK_INVERT);
	} else {
		reg_val &= ~(SI5351_CLK_INVERT);
	}

	si5351_write(self, SI5351_CLK0_CTRL + (uint8_t) clk, reg_val);
}

/*
 * set_clock_source(enum si5351_clock clk, enum si5351_clock_source src)
 *
 * clk - Clock output
 *   (use the si5351_clock enum)
 * src - Which clock source to use for the multisynth
 *   (use the si5351_clock_source enum)
 *
 * Set the clock source for a multisynth (based on the options
 * presented for Registers 16-23 in the Silicon Labs AN619 document).
 * Choices are XTAL, CLKIN, MS0, or the multisynth associated with
 * the clock output.
 */
void si5351_set_clock_source(Si5351 *self, enum si5351_clock clk,
		enum si5351_clock_source src) {
	uint8_t reg_val;
	reg_val = si5351_read(self, SI5351_CLK0_CTRL + (uint8_t) clk);

	// Clear the bits first
	reg_val &= ~(SI5351_CLK_INPUT_MASK);

	switch (src) {
	case SI5351_CLK_SRC_XTAL:
		reg_val |= (SI5351_CLK_INPUT_XTAL);
		break;
	case SI5351_CLK_SRC_CLKIN:
		reg_val |= (SI5351_CLK_INPUT_CLKIN);
		break;
	case SI5351_CLK_SRC_MS0:
		if (clk == SI5351_CLK0) {
			return;
		}

		reg_val |= (SI5351_CLK_INPUT_MULTISYNTH_0_4);
		break;
	case SI5351_CLK_SRC_MS:
		reg_val |= (SI5351_CLK_INPUT_MULTISYNTH_N);
		break;
	default:
		return;
	}

	si5351_write(self, SI5351_CLK0_CTRL + (uint8_t) clk, reg_val);
}

/*
 * set_clock_disable(enum si5351_clock clk, enum si5351_clock_disable dis_state)
 *
 * clk - Clock output
 *   (use the si5351_clock enum)
 * dis_state - Desired state of the output upon disable
 *   (use the si5351_clock_disable enum)
 *
 * Set the state of the clock output when it is disabled. Per page 27
 * of AN619 (Registers 24 and 25), there are four possible values: low,
 * high, high impedance, and never disabled.
 */
void si5351_set_clock_disable(Si5351 *self, enum si5351_clock clk,
		enum si5351_clock_disable dis_state) {
	uint8_t reg_val, reg;

	if (clk >= SI5351_CLK0 && clk <= SI5351_CLK3) {
		reg = SI5351_CLK3_0_DISABLE_STATE;
	} else if (clk >= SI5351_CLK4 && clk <= SI5351_CLK7) {
		reg = SI5351_CLK7_4_DISABLE_STATE;
	} else
		return;

	reg_val = si5351_read(self, reg);

	if (clk >= SI5351_CLK0 && clk <= SI5351_CLK3) {
		reg_val &= ~(0b11 << (clk * 2));
		reg_val |= dis_state << (clk * 2);
	} else if (clk >= SI5351_CLK4 && clk <= SI5351_CLK7) {
		reg_val &= ~(0b11 << ((clk - 4) * 2));
		reg_val |= dis_state << ((clk - 4) * 2);
	}

	si5351_write(self, reg, reg_val);
}

/*
 * set_clock_fanout(enum si5351_clock_fanout fanout, uint8_t enable)
 *
 * fanout - Desired clock fanout
 *   (use the si5351_clock_fanout enum)
 * enable - Set to 1 to enable, 0 to disable
 *
 * Use this function to enable or disable the clock fanout options
 * for individual clock outputs. If you intend to output the XO or
 * CLKIN on the clock outputs, enable this first.
 *
 * By default, only the Multisynth fanout is enabled at startup.
 */
void si5351_set_clock_fanout(Si5351 *self, enum si5351_clock_fanout fanout,
		uint8_t enable) {
	uint8_t reg_val;
	reg_val = si5351_read(self, SI5351_FANOUT_ENABLE);

	switch (fanout) {
	case SI5351_FANOUT_CLKIN:
		if (enable) {
			reg_val |= SI5351_CLKIN_ENABLE;
		} else {
			reg_val &= ~(SI5351_CLKIN_ENABLE);
		}
		break;
	case SI5351_FANOUT_XO:
		if (enable) {
			reg_val |= SI5351_XTAL_ENABLE;
		} else {
			reg_val &= ~(SI5351_XTAL_ENABLE);
		}
		break;
	case SI5351_FANOUT_MS:
		if (enable) {
			reg_val |= SI5351_MULTISYNTH_ENABLE;
		} else {
			reg_val &= ~(SI5351_MULTISYNTH_ENABLE);
		}
		break;
	}

	si5351_write(self, SI5351_FANOUT_ENABLE, reg_val);
}

/*
 * set_pll_input(enum si5351_pll pll, enum si5351_pll_input input)
 *
 * pll - Which PLL to use as the source
 *     (use the si5351_pll enum)
 * input - Which reference oscillator to use as PLL input
 *     (use the si5351_pll_input enum)
 *
 * Set the desired reference oscillator source for the given PLL.
 */
void si5351_set_pll_input(Si5351 *self, enum si5351_pll pll,
		enum si5351_pll_input input) {
	uint8_t reg_val;
	reg_val = si5351_read(self, SI5351_PLL_INPUT_SOURCE);

	// Clear the bits first
	//reg_val &= ~(SI5351_CLKIN_DIV_MASK);

	switch (pll) {
	case SI5351_PLLA:
		if (input == SI5351_PLL_INPUT_CLKIN) {
			reg_val |= SI5351_PLLA_SOURCE;
			reg_val |= self->clkin_div;
			self->plla_ref_osc = SI5351_PLL_INPUT_CLKIN;
		} else {
			reg_val &= ~(SI5351_PLLA_SOURCE);
			self->plla_ref_osc = SI5351_PLL_INPUT_XO;
		}
		break;
	case SI5351_PLLB:
		if (input == SI5351_PLL_INPUT_CLKIN) {
			reg_val |= SI5351_PLLB_SOURCE;
			reg_val |= self->clkin_div;
			self->pllb_ref_osc = SI5351_PLL_INPUT_CLKIN;
		} else {
			reg_val &= ~(SI5351_PLLB_SOURCE);
			self->pllb_ref_osc = SI5351_PLL_INPUT_XO;
		}
		break;
	default:
		return;
	}

	si5351_write(self, SI5351_PLL_INPUT_SOURCE, reg_val);

	si5351_set_pll(self, self->plla_freq, SI5351_PLLA);
	si5351_set_pll(self, self->pllb_freq, SI5351_PLLB);
}

/*
 * set_vcxo(uint64_t pll_freq, uint8_t ppm)
 *
 * pll_freq - Desired PLL base frequency in Hz * 100
 * ppm - VCXO pull limit in ppm
 *
 * Set the parameters for the VCXO on the Si5351B.
 */
void si5351_set_vcxo(Si5351 *self, uint64_t pll_freq, uint8_t ppm) {
	struct Si5351RegSet pll_reg;
	uint64_t vcxo_param;

	// Bounds check
	if (ppm < SI5351_VCXO_PULL_MIN) {
		ppm = SI5351_VCXO_PULL_MIN;
	}

	if (ppm > SI5351_VCXO_PULL_MAX) {
		ppm = SI5351_VCXO_PULL_MAX;
	}

	// Set PLLB params
	vcxo_param = si5351_pll_calc(self, SI5351_PLLB, pll_freq, &pll_reg,
			self->ref_correction[self->pllb_ref_osc], 1);

	// Derive the register values to write

