dimaie/stm32-sdr/Src/si5351_nt7s.c
	// Prepare an array for parameters to be written to
	uint8_t params[20];
	uint8_t i = 0;
	uint8_t temp;

	// Registers 26-27
	temp = ((pll_reg.p3 >> 8) & 0xFF);
	params[i++] = temp;

	temp = (uint8_t) (pll_reg.p3 & 0xFF);
	params[i++] = temp;

	// Register 28
	temp = (uint8_t) ((pll_reg.p1 >> 16) & 0x03);
	params[i++] = temp;

	// Registers 29-30
	temp = (uint8_t) ((pll_reg.p1 >> 8) & 0xFF);
	params[i++] = temp;

	temp = (uint8_t) (pll_reg.p1 & 0xFF);
	params[i++] = temp;

	// Register 31
	temp = (uint8_t) ((pll_reg.p3 >> 12) & 0xF0);
	temp += (uint8_t) ((pll_reg.p2 >> 16) & 0x0F);
	params[i++] = temp;

	// Registers 32-33
	temp = (uint8_t) ((pll_reg.p2 >> 8) & 0xFF);
	params[i++] = temp;

	temp = (uint8_t) (pll_reg.p2 & 0xFF);
	params[i++] = temp;

	// Write the parameters
	si5351_write_bulk(self, SI5351_PLLB_PARAMETERS, i, params);

	// Write the VCXO parameters
	vcxo_param = ((vcxo_param * ppm * SI5351_VCXO_MARGIN) / 100ULL)
			/ 1000000ULL;

	temp = (uint8_t) (vcxo_param & 0xFF);
	si5351_write(self, SI5351_VXCO_PARAMETERS_LOW, temp);

	temp = (uint8_t) ((vcxo_param >> 8) & 0xFF);
	si5351_write(self, SI5351_VXCO_PARAMETERS_MID, temp);

	temp = (uint8_t) ((vcxo_param >> 16) & 0x3F);
	si5351_write(self, SI5351_VXCO_PARAMETERS_HIGH, temp);
}

/*
 * set_ref_freq(uint32_t ref_freq, enum si5351_pll_input ref_osc)
 *
 * ref_freq - Reference oscillator frequency in Hz
 * ref_osc - Which reference oscillator frequency to set
 *    (use the si5351_pll_input enum)
 *
 * Set the reference frequency value for the desired reference oscillator
 */
void si5351_set_ref_freq(Si5351 *self, uint32_t ref_freq,
		enum si5351_pll_input ref_osc) {
	// uint8_t reg_val;
	//reg_val = si5351_read(SI5351_PLL_INPUT_SOURCE);

	// Clear the bits first
	//reg_val &= ~(SI5351_CLKIN_DIV_MASK);

	if (ref_freq <= 30000000UL) {
		self->xtal_freq[(uint8_t) ref_osc] = ref_freq;
		//reg_val |= SI5351_CLKIN_DIV_1;
		if (ref_osc == SI5351_PLL_INPUT_CLKIN) {
			self->clkin_div = SI5351_CLKIN_DIV_1;
		}
	} else if (ref_freq > 30000000UL && ref_freq <= 60000000UL) {
		self->xtal_freq[(uint8_t) ref_osc] = ref_freq / 2;
		//reg_val |= SI5351_CLKIN_DIV_2;
		if (ref_osc == SI5351_PLL_INPUT_CLKIN) {
			self->clkin_div = SI5351_CLKIN_DIV_2;
		}
	} else if (ref_freq > 60000000UL && ref_freq <= 100000000UL) {
		self->xtal_freq[(uint8_t) ref_osc] = ref_freq / 4;
		//reg_val |= SI5351_CLKIN_DIV_4;
		if (ref_osc == SI5351_PLL_INPUT_CLKIN) {
			self->clkin_div = SI5351_CLKIN_DIV_4;
		}
	} else {
		//reg_val |= SI5351_CLKIN_DIV_1;
	}

	//si5351_write(SI5351_PLL_INPUT_SOURCE, reg_val);
}

uint8_t si5351_write_bulk(Si5351* self, uint8_t addr, uint8_t bytes, uint8_t *data) {
    if (HAL_I2C_Mem_Write(&hi2c1, self->i2c_bus_addr << 1, addr,
                          I2C_MEMADD_SIZE_8BIT, data, bytes, 100) != HAL_OK) {
        return 0xFF; // error
    }
    return 0;
}

uint8_t si5351_write(Si5351 *self, uint8_t addr, uint8_t data) {
    if (HAL_I2C_Mem_Write(&hi2c1, self->i2c_bus_addr << 1, addr,
                          I2C_MEMADD_SIZE_8BIT, &data, 1, 100) != HAL_OK) {
        return 0xFF; // error
    }
    return 0;
}

uint8_t si5351_read(Si5351 *self, uint8_t addr) {
    uint8_t reg_val = 0;
    if (HAL_I2C_Mem_Read(&hi2c1, self->i2c_bus_addr << 1, addr,
                         I2C_MEMADD_SIZE_8BIT, &reg_val, 1, 100) != HAL_OK) {
        return 0xFF; // error
    }
    return reg_val;
}

/*********************/
/* Private functions */
/*********************/

uint64_t si5351_pll_calc(Si5351 *self, enum si5351_pll pll, uint64_t freq,
		struct Si5351RegSet *reg, int32_t correction, uint8_t vcxo) {
	uint64_t ref_freq;
	if (pll == SI5351_PLLA) {
		ref_freq = self->xtal_freq[(uint8_t) self->plla_ref_osc] * SI5351_FREQ_MULT;
	} else {
		ref_freq = self->xtal_freq[(uint8_t) self->pllb_ref_osc] * SI5351_FREQ_MULT;
	}
	//ref_freq = 15974400ULL * SI5351_FREQ_MULT;
	uint32_t a, b, c, p1, p2, p3;
	uint64_t lltmp; //, denom;

	// Factor calibration value into nominal crystal frequency
	// Measured in parts-per-billion

	ref_freq = ref_freq
			+ (int32_t) ((((((int64_t) correction) << 31) / 1000000000LL)
					* ref_freq) >> 31);

	// PLL bounds checking
	if (freq < SI5351_PLL_VCO_MIN * SI5351_FREQ_MULT) {
		freq = SI5351_PLL_VCO_MIN * SI5351_FREQ_MULT;
	}
	if (freq > SI5351_PLL_VCO_MAX * SI5351_FREQ_MULT) {
		freq = SI5351_PLL_VCO_MAX * SI5351_FREQ_MULT;
	}

	// Determine integer part of feedback equation
	a = freq / ref_freq;

	if (a < SI5351_PLL_A_MIN) {
		freq = ref_freq * SI5351_PLL_A_MIN;
	}
	if (a > SI5351_PLL_A_MAX) {
		freq = ref_freq * SI5351_PLL_A_MAX;
	}

	// Find best approximation for b/c = fVCO mod fIN
	// denom = 1000ULL * 1000ULL;
	// lltmp = freq % ref_freq;
	// lltmp *= denom;
	// do_div(lltmp, ref_freq);

	//b = (((uint64_t)(freq % ref_freq)) * RFRAC_DENOM) / ref_freq;
	if (vcxo) {
		b = (((uint64_t) (freq % ref_freq)) * 1000000ULL) / ref_freq;
		c = 1000000ULL;
	} else {
		b = (((uint64_t) (freq % ref_freq)) * RFRAC_DENOM) / ref_freq;
		c = b ? RFRAC_DENOM : 1;
	}

	// Calculate parameters
	p1 = 128 * a + ((128 * b) / c) - 512;
	p2 = 128 * b - c * ((128 * b) / c);
	p3 = c;

	// Recalculate frequency as fIN * (a + b/c)
	lltmp = ref_freq;
	lltmp *= b;
	do_div(lltmp, c);
	freq = lltmp;
	freq += ref_freq * a;

	reg->p1 = p1;
	reg->p2 = p2;
	reg->p3 = p3;

	if (vcxo) {
		return (uint64_t) (128 * a * 1000000ULL + b);
	} else {
		return freq;
	}
}

uint64_t si5351_multisynth_calc(Si5351 *self, uint64_t freq, uint64_t pll_freq,
		struct Si5351RegSet *reg) {
	uint64_t lltmp;
	uint32_t a, b, c, p1, p2, p3;
	uint8_t divby4 = 0;
	uint8_t ret_val = 0;

	// Multisynth bounds checking
	if (freq > SI5351_MULTISYNTH_MAX_FREQ * SI5351_FREQ_MULT) {
		freq = SI5351_MULTISYNTH_MAX_FREQ * SI5351_FREQ_MULT;
	}
	if (freq < SI5351_MULTISYNTH_MIN_FREQ * SI5351_FREQ_MULT) {
		freq = SI5351_MULTISYNTH_MIN_FREQ * SI5351_FREQ_MULT;
	}

	if (freq >= SI5351_MULTISYNTH_DIVBY4_FREQ * SI5351_FREQ_MULT) {
		divby4 = 1;
	}

	if (pll_freq == 0) {
		// Find largest integer divider for max
		// VCO frequency and given target frequency
		if (divby4 == 0) {
			lltmp = SI5351_PLL_VCO_MAX * SI5351_FREQ_MULT; // margin needed?
			do_div(lltmp, freq);
			if (lltmp == 5) {
				lltmp = 4;
			} else if (lltmp == 7) {
				lltmp = 6;
			}
			a = (uint32_t) lltmp;
		} else {
			a = 4;
		}

		b = 0;
		c = 1;
		pll_freq = a * freq;
	} else {
		// Preset PLL, so return the actual freq for these params instead of PLL freq
		ret_val = 1;

		// Determine integer part of feedback equation
		a = pll_freq / freq;

		if (a < SI5351_MULTISYNTH_A_MIN) {
			freq = pll_freq / SI5351_MULTISYNTH_A_MIN;
		}
		if (a > SI5351_MULTISYNTH_A_MAX) {
			freq = pll_freq / SI5351_MULTISYNTH_A_MAX;
		}

