dimaie/stm32-sdr/Src/si5351_nt7s.c
		b = (pll_freq % freq * RFRAC_DENOM) / freq;
		c = b ? RFRAC_DENOM : 1;
	}

	// Calculate parameters
	if (divby4 == 1) {
		p3 = 1;
		p2 = 0;
		p1 = 0;
	} else {
		p1 = 128 * a + ((128 * b) / c) - 512;
		p2 = 128 * b - c * ((128 * b) / c);
		p3 = c;
	}

	reg->p1 = p1;
	reg->p2 = p2;
	reg->p3 = p3;

	if (ret_val == 0) {
		return pll_freq;
	} else {
		return freq;
	}
}

uint64_t si5351_multisynth67_calc(Si5351 *self, uint64_t freq,
		uint64_t pll_freq, struct Si5351RegSet *reg) {
	//uint8_t p1;
	// uint8_t ret_val = 0;
	uint32_t a;
	uint64_t lltmp;

	// Multisynth bounds checking
	if (freq > SI5351_MULTISYNTH67_MAX_FREQ * SI5351_FREQ_MULT) {
		freq = SI5351_MULTISYNTH67_MAX_FREQ * SI5351_FREQ_MULT;
	}
	if (freq < SI5351_MULTISYNTH_MIN_FREQ * SI5351_FREQ_MULT) {
		freq = SI5351_MULTISYNTH_MIN_FREQ * SI5351_FREQ_MULT;
	}

	if (pll_freq == 0) {
		// Find largest integer divider for max
		// VCO frequency and given target frequency
		lltmp = (SI5351_PLL_VCO_MAX * SI5351_FREQ_MULT) - 100000000UL; // margin needed?
		do_div(lltmp, freq);
		a = (uint32_t) lltmp;

		// Divisor has to be even
		if (a % 2 != 0) {
			a++;
		}

		// Divisor bounds check
		if (a < SI5351_MULTISYNTH_A_MIN) {
			a = SI5351_MULTISYNTH_A_MIN;
		}
		if (a > SI5351_MULTISYNTH67_A_MAX) {
			a = SI5351_MULTISYNTH67_A_MAX;
		}

		pll_freq = a * freq;

		// PLL bounds checking
		if (pll_freq > (SI5351_PLL_VCO_MAX * SI5351_FREQ_MULT)) {
			a -= 2;
			pll_freq = a * freq;
		} else if (pll_freq < (SI5351_PLL_VCO_MIN * SI5351_FREQ_MULT)) {
			a += 2;
			pll_freq = a * freq;
		}

		reg->p1 = (uint8_t) a;
		reg->p2 = 0;
		reg->p3 = 0;
		return pll_freq;
	} else {
		// Multisynth frequency must be integer division of PLL
		if (pll_freq % freq) {
			// No good
			return 0;
		} else {
			a = pll_freq / freq;

			// Division ratio bounds check
			if (a < SI5351_MULTISYNTH_A_MIN || a > SI5351_MULTISYNTH67_A_MAX) {
				// No bueno
				return 0;
			} else {
				reg->p1 = (uint8_t) a;
				reg->p2 = 0;
				reg->p3 = 0;
				return 1;
			}
		}
	}
}

void si5351_update_sys_status(Si5351 *self, struct Si5351Status *status) {
	uint8_t reg_val = 0;

	reg_val = si5351_read(self, SI5351_DEVICE_STATUS);

	// Parse the register
	status->SYS_INIT = (reg_val >> 7) & 0x01;
	status->LOL_B = (reg_val >> 6) & 0x01;
	status->LOL_A = (reg_val >> 5) & 0x01;
	status->LOS = (reg_val >> 4) & 0x01;
	status->REVID = reg_val & 0x03;
}

void si5351_update_int_status(Si5351 *self, struct Si5351IntStatus *int_status) {
	uint8_t reg_val = 0;

	reg_val = si5351_read(self, SI5351_INTERRUPT_STATUS);

	// Parse the register
	int_status->SYS_INIT_STKY = (reg_val >> 7) & 0x01;
	int_status->LOL_B_STKY = (reg_val >> 6) & 0x01;
	int_status->LOL_A_STKY = (reg_val >> 5) & 0x01;
	int_status->LOS_STKY = (reg_val >> 4) & 0x01;
}

void si5351_ms_div(Si5351 *self, enum si5351_clock clk, uint8_t r_div,
		uint8_t div_by_4) {
	uint8_t reg_val = 0;
	uint8_t reg_addr = 0;

	switch (clk) {
	case SI5351_CLK0:
		reg_addr = SI5351_CLK0_PARAMETERS + 2;
		break;
	case SI5351_CLK1:
		reg_addr = SI5351_CLK1_PARAMETERS + 2;
		break;
	case SI5351_CLK2:
		reg_addr = SI5351_CLK2_PARAMETERS + 2;
		break;
	case SI5351_CLK3:
		reg_addr = SI5351_CLK3_PARAMETERS + 2;
		break;
	case SI5351_CLK4:
		reg_addr = SI5351_CLK4_PARAMETERS + 2;
		break;
	case SI5351_CLK5:
		reg_addr = SI5351_CLK5_PARAMETERS + 2;
		break;
	case SI5351_CLK6:
		reg_addr = SI5351_CLK6_7_OUTPUT_DIVIDER;
		break;
	case SI5351_CLK7:
		reg_addr = SI5351_CLK6_7_OUTPUT_DIVIDER;
		break;
	}

	reg_val = si5351_read(self, reg_addr);

	if (clk <= (uint8_t) SI5351_CLK5) {
		// Clear the relevant bits
		reg_val &= ~(0x7c);

		if (div_by_4 == 0) {
			reg_val &= ~(SI5351_OUTPUT_CLK_DIVBY4);
		} else {
			reg_val |= (SI5351_OUTPUT_CLK_DIVBY4);
		}

		reg_val |= (r_div << SI5351_OUTPUT_CLK_DIV_SHIFT);
	} else if (clk == SI5351_CLK6) {
		// Clear the relevant bits
		reg_val &= ~(0x07);

		reg_val |= r_div;
	} else if (clk == SI5351_CLK7) {
		// Clear the relevant bits
		reg_val &= ~(0x70);

		reg_val |= (r_div << SI5351_OUTPUT_CLK_DIV_SHIFT);
	}

	si5351_write(self, reg_addr, reg_val);
}

uint8_t si5351_select_r_div(Si5351 *self, uint64_t *freq) {
	uint8_t r_div = SI5351_OUTPUT_CLK_DIV_1;

	// Choose the correct R divider
	if ((*freq >= SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT)
			&& (*freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 2)) {
		r_div = SI5351_OUTPUT_CLK_DIV_128;
		*freq *= 128ULL;
	} else if ((*freq >= SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 2)
			&& (*freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 4)) {
		r_div = SI5351_OUTPUT_CLK_DIV_64;
		*freq *= 64ULL;
	} else if ((*freq >= SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 4)
			&& (*freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 8)) {
		r_div = SI5351_OUTPUT_CLK_DIV_32;
		*freq *= 32ULL;
	} else if ((*freq >= SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 8)
			&& (*freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 16)) {
		r_div = SI5351_OUTPUT_CLK_DIV_16;
		*freq *= 16ULL;
	} else if ((*freq >= SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 16)
			&& (*freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 32)) {
		r_div = SI5351_OUTPUT_CLK_DIV_8;
		*freq *= 8ULL;
	} else if ((*freq >= SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 32)
			&& (*freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 64)) {
		r_div = SI5351_OUTPUT_CLK_DIV_4;
		*freq *= 4ULL;
	} else if ((*freq >= SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 64)
			&& (*freq < SI5351_CLKOUT_MIN_FREQ * SI5351_FREQ_MULT * 128)) {
		r_div = SI5351_OUTPUT_CLK_DIV_2;
		*freq *= 2ULL;
	}

	return r_div;
}

uint8_t si5351_select_r_div_ms67(Si5351 *self, uint64_t *freq) {
	uint8_t r_div = SI5351_OUTPUT_CLK_DIV_1;

	// Choose the correct R divider
	if ((*freq >= SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT)
			&& (*freq < SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 2)) {
		r_div = SI5351_OUTPUT_CLK_DIV_128;
		*freq *= 128ULL;
	} else if ((*freq >= SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 2)
			&& (*freq < SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 4)) {
		r_div = SI5351_OUTPUT_CLK_DIV_64;
		*freq *= 64ULL;
	} else if ((*freq >= SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 4)
			&& (*freq < SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 8)) {
		r_div = SI5351_OUTPUT_CLK_DIV_32;
		*freq *= 32ULL;
	} else if ((*freq >= SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 8)
			&& (*freq < SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 16)) {
		r_div = SI5351_OUTPUT_CLK_DIV_16;
		*freq *= 16ULL;
	} else if ((*freq >= SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 16)
			&& (*freq < SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 32)) {
		r_div = SI5351_OUTPUT_CLK_DIV_8;
		*freq *= 8ULL;
	} else if ((*freq >= SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 32)
			&& (*freq < SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 64)) {
		r_div = SI5351_OUTPUT_CLK_DIV_4;
		*freq *= 4ULL;
	} else if ((*freq >= SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 64)
			&& (*freq < SI5351_CLKOUT67_MIN_FREQ * SI5351_FREQ_MULT * 128)) {
		r_div = SI5351_OUTPUT_CLK_DIV_2;
		*freq *= 2ULL;
	}

	return r_div;
}
